bench/results/java25/20260309T225350Z/load.stdout.txt
{"ok": true, "tool": "wrk", "url": "http://localhost:8080/api/gateway/orders", "duration_s": 5, "warmup_s": 1, "concurrency": 4, "threads": 4, "requests_per_sec": 775.04, "p50": "4.84ms", "p95": "9.24ms", "p99": "11.21ms", "http_non2xx": "na", "socket_errors": {}, "raw_excerpt": "Running 5s test @ http://localhost:8080/api/gateway/orders\n  4 threads and 4 connections\n  Thread Stats   Avg      Stdev     Max   +/- Stdev\n    Latency     5.18ms    1.64ms  20.68ms   77.70%\n    Req/Sec   194.68     38.76   292.00     72.00%\n  Latency Distribution\n     50%    4.84ms\n     75%    5.79ms\n     90%    7.27ms\n     99%   11.21ms\n  3879 requests in 5.00s, 0.88MB read\nRequests/sec:    775.04\nTransfer/sec:    180.89KB"}